driver-tests/bpelse/faulthandling/StandardFaultsJbi/test/CorrelationViolation_ThrowFromInvoke_Case2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://xml.netbeans.org/schema/StandardFaultsBpel/src/CorrelationViolation/XmlSchema">
  <soapenv:Body>
    <xs:Message>
      <xs:Id1>corr12</xs:Id1>
      <xs:Id2>corr22</xs:Id2>
      <xs:Data>case2</xs:Data>
    </xs:Message>
  </soapenv:Body>
</soapenv:Envelope>