driver-tests/bpelse/faulthandling/StandardFaultsJbi/test/CorrelationViolation_ThrowFromInvoke_Case2/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Message xmlns="http://xml.netbeans.org/schema/StandardFaultsBpel/src/CorrelationViolation/XmlSchema">
      <ns0:Id1 xmlns:ns0="http://xml.netbeans.org/schema/StandardFaultsBpel/src/CorrelationViolation/XmlSchema">corr12</ns0:Id1>
      <ns0:Id2 xmlns:ns0="http://xml.netbeans.org/schema/StandardFaultsBpel/src/CorrelationViolation/XmlSchema">corr22</ns0:Id2>
      <ns0:Data xmlns:ns0="http://xml.netbeans.org/schema/StandardFaultsBpel/src/CorrelationViolation/XmlSchema">SuccessCorrelation Already Initiated</ns0:Data>
    </Message>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
